app/controllers/locations_controller.rb

SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 40.4435092) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -79.9415709) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 40.4435092 AND locations.longitude >= -79.9415709) THEN 45.0 WHEN (locations.latitude < 40.4435092 AND locations.longitude >= -79.9415709) THEN 135.0 WHEN (locations.latitude < 40.4435092 AND locations.longitude < -79.9415709) THEN 225.0 WHEN (locations.latitude >= 40.4435092 AND locations.longitude < -79.9415709) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 25.970330888915207 AND 54.916687511084795 AND locations.longitude BETWEEN -98.95905452380066 AND -60.92408727619935 AND locations.id != 2) ORDER BY distance ASC
---
  def show
    @location = Location.find(params[:id])

INSERT INTO "locations" ("address", "created_at", "gmaps", "latitude", "longitude", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save